/* Создать массив и произвести над ним следующие 5 операций:

Создайте массив styles с элементами «Джаз» и «Блюз».
Добавьте «Рок-н-ролл» в конец.
Замените значение в середине на «Классика». Ваш код для поиска значения в середине должен работать для массивов с любой длиной.
Удалите первый элемент массива и покажите его.
Вставьте «Рэп» и «Регги» в начало массива.

Массив по ходу выполнения операций:

Джаз, Блюз
Джаз, Блюз, Рок-н-ролл
Джаз, Классика, Рок-н-ролл
Классика, Рок-н-ролл
Рэп, Регги, Классика, Рок-н-ролл
*/

const styles = ['Jazz', 'Blues'];

styles.push('Rock-n-Roll')

const substituteMiddle = (array, item) => {
    const middleIndex = array.length / 2
    array.splice(middleIndex, 1, item)   
}

substituteMiddle(styles, 'Classic')

console.log(styles.shift())

styles.unshift('Rap', 'Reggae')